[
  {
    "url": "https://bhcglobal.com",
    "headings": [
      "Ready to power your digital future?",
      "AMI InsightAccelerator",
      "──",
      "──"
    ],
    "content": "Start here - intelligence that improves every customer interaction Amplifying the Value of AMI 1.0 and 2.0 Intelligence Interested in working with us? Stay up to date with the latest news and announcements Careers Locations BHC Portal Website→ 1-800-253-3449 90 Airpark Dr Ste 200, Rochester, NY 14624 X Website→ 1-800-253-3449 295 Robinson St, Suite 101 Oakville, ON L6J 1G7 X"
  },
  {
    "url": "https://bhcglobal.com/amiaccelerator",
    "headings": [
      "AMI InsightAccelerator",
      "Amplifying the Value of AMI 1.0 and 2.0 Intelligence",
      "Today’s utilities are harvesting less than 20% of the intelligence produced by their AMI investments",
      "Built on “Best of Breed”",
      "Insight Accelerator Technologies",
      "AMI Vendor Agnostic",
      "Unmatched Use Case Catalog",
      "Seamless Integration",
      "AMI Use Case Portfolio",
      "Domain Experts & Architects",
      "Versatility across AMI 1.0 and 2.0",
      "Empowered Employees",
      "Contact Us to Learn More:"
    ],
    "content": "powered byBHC Global Despite massive investments in AMI and smart grid infrastructure—and over 1.2 billion smart meters installed globally—most utilities are still only operationalizing a fraction of the potential insights. This challenge is becoming even more pronounced as utilities move to AMI 2.0, which promises higher velocity and unprecedented granularity. OurAMI Insight Acceleratorbrings together a powerful suite of AI-powered, best-of-breed analytics platforms with seamless integration into utilities’ existing IT and OT environments. This unlocks a powerful catalog of cutting-edge use cases that deliver immediate value to both the enterprise and its customers. Given the speed with which the smart grid is evolving, it is becoming difficult for even the largest AMI vendors and analytics providers to provide universal coverage across every functional use case, resulting in limited coverage or highly diluted use cases.That’s why we have assembled a collection of domain-specific experts and pre-vetted solutionstailored to the unique functional challenges and business strategies critical to today’s industry transition. Our analytics are designed to work across any hardware or software platforms underpinning your AMI deployment. This means every analytics insight performed or use case developed can evolve with you, regardless of which vendors you use now or in the future. You always have best-of-breed solutions on the field with you, giving you maximum flexibility at every step. Our portfolio of AMI intelligence use cases is unmatched, with over 65 use cases ready to be deployed within your AMI environment. Our coverage is wide and deep, cutting across all major functions, business units, and application areas. From Grid Planning and Operations to Customer Experience, Energy Procurement, and Energy Resources, we’ve got you covered. We also offer use cases that extend beyond the utility through our consent-driven third-party intelligence platform. BHC Global and our network of specialized integration partners work to connect AMI use cases seamlessly across your existing IT and OT digital portfolio. This includes accessing and conditioning data from the head-end system, MDM, and other parts of your metering ecosystem, then channeling insights into the systems that apply them in real operational context. Many of these integrations are preconfigured and already compatible with leading enterprise software platforms. Requires AMI 2.0 All of our use cases and blueprints have been architected by domain experts who have led the application of analytics successfully in actual utility settings. This bench of experts has shaped use cases across grid strategy, planning, operations, energy trading, risk management, customer engagement, complex rates, and countless others. Utilities using our AMI accelerator can access this expertise throughout use case implementation and deployment to drive value in every application. Not every utility is at the same stage in their AMI journey. Some are still using analog or AMI meters. Many are mid-cycle with AMI 1.0 and just beginning to consider plans for replacement. Others are well down the path of deploying AMI 2.0 grid connected technology and gaining access to a wealth of high-velocity intelligence. Our solutions work across all stages of this journey, from AMI 1.0 deployment through upgrade cycles, helping you capture value at every phase. Our AMI Insight Accelerator provides full training and coaching to your employees and users for any deployed use cases. Those applying the insights understand the role of the data and how it will be utilized for reporting, visualization, and decision-making. This keeps your organization aligned and empowered as it evolves into a more data- and intelligence-driven culture. US/ GlobalBob Champagne:bchampagne@bhcglobal.com(US/ Global) CanadaFrank Carnevale:fcarnevale@bhcglobal.com(US/ Global) Careers Locations BHC Portal Website→ 1-800-253-3449 90 Airpark Dr Ste 200, Rochester, NY 14624 X Website→ 1-800-253-3449 295 Robinson St, Suite 101 Oakville, ON L6J 1G7 X"
  },
  {
    "url": "https://bhcglobal.com/locations",
    "headings": [
      "L O C A T I O N S"
    ],
    "content": "Toll Free:1-800-253-3449 Information:info@bhcglobal.com Headquarters:90 Airpark Dr Ste 200,Rochester, NY 14624 Toll Free:1-800-253-3449 Information:info@bhcglobal.com Headquarters:295 Robinson St, Suite 101Oakville, ON L6J 1G7 Careers Locations BHC Portal Website→ 1-800-253-3449 90 Airpark Dr Ste 200, Rochester, NY 14624 X Website→ 1-800-253-3449 295 Robinson St, Suite 101 Oakville, ON L6J 1G7 X"
  },
  {
    "url": "https://bhcglobal.com#page",
    "headings": [
      "Ready to power your digital future?",
      "AMI InsightAccelerator",
      "──",
      "──"
    ],
    "content": "Start here - intelligence that improves every customer interaction Amplifying the Value of AMI 1.0 and 2.0 Intelligence Interested in working with us? Stay up to date with the latest news and announcements Careers Locations BHC Portal Website→ 1-800-253-3449 90 Airpark Dr Ste 200, Rochester, NY 14624 X Website→ 1-800-253-3449 295 Robinson St, Suite 101 Oakville, ON L6J 1G7 X"
  },
  {
    "url": "https://bhcglobal.com/about-us",
    "headings": [
      "A B O U T   U S",
      "BHC Global is a 100% utility-focused systems integrator with a 25 year track record of delivering high quality systems and implementations.",
      "Leadership Team",
      "BHC Global Solution Center",
      "Driving Digital Innovation for Energy & Utilities",
      "Our Clients",
      "BHC Advantages"
    ],
    "content": "Founded in 1999, BHC Global (formerly Blue Heron Consulting) has developed extensive expertise in successfully designing, implementing, and upgrading SPL and Oracle Utilities suite of products at over 30 client sites ranging in size from approximately 26,000 end customers to over 4.3 million customers. BHC’s experience implementing Oracle Utilities applications includes: Customer Cloud Service (CCS) Customer to Meter (C2M) Customer Care and Billing (CC&B) Meter Data Management (MDM) Market Transaction Management (MTM) Mobile Workforce Management (MWM) Work and Asset Management (WAM) Digital Self Service (DSS) Smart Grid Gateway (SGG) Service Order Management (SOM) In addition to its core system integration practice, BHC Global also provides comprehensive managed services and support programs, project health and upgrade assessments, upgrades, configuration audits and staff augmentation across the Oracle Utilities product suite. To see more information about BHC services click the link below. Stephen NorthrupOwner / CEO Linkedin> Christina DeBellisPresident, BHC Global Linkedin> Linkedin> Frank CarnevalePresident, BHC Canada Linkedin> Linkedin> Tu Lam-MooreChief Functional Architect Linkedin> Cindy VillavicencioChief AMI and MDM Architect Linkedin> Bob ChampagneDigital Transformation Officer Linkedin> Linkedin> Chris NealBHC Client Partner (Canada) Linkedin Victoria WeberVice President Customer Relations Linkedin> BHC has the distinct advantage of working with past and present versions of  Oracle Utility Products going back to the mid -1990s when the product was built and owned by SPL. BHC Global’s New York based Oracle Utilities Solution Center is comprised of Centers of Excellence (CoE)that support all aspects of BHC’s projects and consulting practice (PMO, infrastructure, reports, interfaces, conversion, training, enhancements, etc.). Each center of excellence is comprised of small teams of highly skilled and specialized architects, designers and programmers that are responsible for delivering key project related deliverables. BHC’s Solution Center lowers implementation costs, ensures better quality, decreases risk and delivers a less stressful development process. BHC’s USA-based Solution Center is the central hub of our technical consulting group. Staffed by an experienced team of senior Oracle product experts, architects and consultants, the Solution Center has consistently streamlined project deliverables, provided quality solutions, and delivered a highly efficient configuration and development process to utilities. Our project accelerators and templates have reliably given utilities a head start on their implementation and upgrade projects to expedite project schedules, ensures better quality, decreases risk and delivers a less stressful development process. BHC provides advisory, system integration, and managed services to help energy and utility companies turn digital innovation into real business results. We use a strategic approach, portfolio management, and advanced platforms to harness data, AI, and insights for better efficiency, lower costs, and smarter decision-making. Our solutions deliver: Strategic Approach & Measurable Results– Aligning digital investments with real business impact. Portfolio Management for Smart Investments– Ensuring technology decisions drive tangible outcomes. Best-in-Class Platforms & Technology– Leveraging proven solutions and industry leaders. Faster, Cost-Effective Integration– Reducing project risks and lowering costs. AI-Driven Innovation & Data Insights– Powering smarter decisions and seamless digital experiences. Collaborative Growth & Best Practices– Connecting industry leaders for innovation and knowledge sharing. BHC has provided integration services to various clients since our inception. We are proud to serve our growing list of global customers. Extensive background with utilities possessing functional and technical requirements where we provided system integration services and/or business solutions to meet challenging or tight project budgets and timelines. Low risk implementations due to our industry leading data conversion practice, senior architects, and proven, repeatable Fast Track Implementation Methodology. With an average tenure of eight years working for BHC Global and fourteen serving utilities, our consultants are some of the brightest, most experienced and most creative in the industry. Specialized Solution Center with Centers of Excellence dedicated to the support and maintenance of Oracle Utilities clients during and post implementation. BHC is a certified Oracle Gold Partner and an Oracle authorized reseller, thus facilitating your award and contractual processes. Affordable, high quality, objective, and value based consulting. Careers Locations BHC Portal Website→ 1-800-253-3449 90 Airpark Dr Ste 200, Rochester, NY 14624 X Website→ 1-800-253-3449 295 Robinson St, Suite 101 Oakville, ON L6J 1G7 X"
  },
  {
    "url": "https://bhcglobal.com/careers",
    "headings": [
      "C A R E E R S",
      "Conversion Architect",
      "Functional Architect",
      "Technical Architect",
      "Designer / Developer",
      "Test and Training Lead",
      "Project Manager"
    ],
    "content": "BHC Global focuses on the utility industry implementation and consulting primarily for Oracle Utilities product suite. Consultants experienced in Oracle Utilities software are encouraged to apply. If you are interested in a position please select the desired position below and click apply. Full Description → Apply → Full Description → Apply → Full Description → Apply → Full Description → Apply → Full Description → Apply → Full Description → Apply → Careers Locations BHC Portal Website→ 1-800-253-3449 90 Airpark Dr Ste 200, Rochester, NY 14624 X Website→ 1-800-253-3449 295 Robinson St, Suite 101 Oakville, ON L6J 1G7 X"
  },
  {
    "url": "https://bhcglobal.com/",
    "headings": [
      "Ready to power your digital future?",
      "AMI InsightAccelerator",
      "──",
      "──"
    ],
    "content": "Start here - intelligence that improves every customer interaction Amplifying the Value of AMI 1.0 and 2.0 Intelligence Interested in working with us? Stay up to date with the latest news and announcements Careers Locations BHC Portal Website→ 1-800-253-3449 90 Airpark Dr Ste 200, Rochester, NY 14624 X Website→ 1-800-253-3449 295 Robinson St, Suite 101 Oakville, ON L6J 1G7 X"
  },
  {
    "url": "https://bhcglobal.com/designer-developer",
    "headings": [
      "Designer / Developer"
    ],
    "content": "Description Hands on technical experience designing and developing custom solutions for Oracle Utilities Applications. Requirements Experience with Customer Information Systems Oracle CC&B v2.1-2.7/C2M (predecessor applications SPL, CIS+, PeopleSoft are a plus) Strong ability to Design and Develop customizations and new functionalities on Strong ability to convert client requirements into technical design documents Provide estimates based on functional design documents Strong ability to create Technical Design documents Convert technical design documents into high quality working code within agreed budgets and timeframes Strong ability to create Unit Test documents Strong ability to investigate and fix defects raised during Quality Assurance phase Strong knowledge of schema (tables and relationships) A deep understanding of all phases of a project life cycle implementation Bachelor’s Degree or equivalent in Information Technology, Computer Science, or a closely related field Careers Locations BHC Portal Website→ 1-800-253-3449 90 Airpark Dr Ste 200, Rochester, NY 14624 X Website→ 1-800-253-3449 295 Robinson St, Suite 101 Oakville, ON L6J 1G7 X"
  },
  {
    "url": "https://bhcglobal.com/contact",
    "headings": [
      "C O N T A C T"
    ],
    "content": "Toll Free:1-800-253-3449 Information:info@bhcglobal.com Headquarters:90 Airpark Dr Ste 200,Rochester, NY 14624 Careers Locations BHC Portal Website→ 1-800-253-3449 90 Airpark Dr Ste 200, Rochester, NY 14624 X Website→ 1-800-253-3449 295 Robinson St, Suite 101 Oakville, ON L6J 1G7 X"
  },
  {
    "url": "https://bhcglobal.com/services",
    "headings": [
      "S E R V I C E S",
      "Implementation & Upgrade Services",
      "Advisory, Assessment, & Testing Services",
      "Staffing & Managed Support Services",
      "Training Programs and Services",
      "Products & Partners"
    ],
    "content": "System Implementation– stable, low defect production system installations of Oracle Utilities products which prioritize aligning expert configurations and solutions to business requirements Software Version Upgrades– use BHC’s unparalleled experience and lessons learned to upgrade your production system to the latest product version Solution Center– tap into BHC’s onshore Solution Center to deliver high quality and affordable configuration and development for your system including reports, interfaces, and customized solutions Time to Value– Proven, repeatable fast track implementation options available to accelerate project schedules and drastically reduce costs Upgrade assessments and project roadmaps for Utilities of all sizes Oracle Utility Product configuration audits to assess and optimize system functionality Enterprise & Project Health Assessment Digitial Transformation Strategies Project Quality Assurance & Portfolio Management Independent Testing Validation Staff augmentation to supplement/complement a Utility’s current resources during and after projects Flexible support solutions and options for maintaining your production system Customizable functional and technical support services available for every budget 7 x 24 x 365 support available remotely from BHC Solution Center in NY, or on-site as needed Knowledge transfer and customized training solution programs for business and IT departments Oracle Utilties bootcamps Functional training for end users Post production operational and system maintenance best practice training for customers seeking vendor independence (e.g. developers training, code packaging/deployment, BI Publisher, etc.) Careers Locations BHC Portal Website→ 1-800-253-3449 90 Airpark Dr Ste 200, Rochester, NY 14624 X Website→ 1-800-253-3449 295 Robinson St, Suite 101 Oakville, ON L6J 1G7 X"
  },
  {
    "url": "https://bhcglobal.com/cart",
    "headings": [],
    "content": "Careers Locations BHC Portal Website→ 1-800-253-3449 90 Airpark Dr Ste 200, Rochester, NY 14624 X Website→ 1-800-253-3449 295 Robinson St, Suite 101 Oakville, ON L6J 1G7 X"
  },
  {
    "url": "https://bhcglobal.com/apply",
    "headings": [],
    "content": "← Careers ← Careers Careers Locations BHC Portal Website→ 1-800-253-3449 90 Airpark Dr Ste 200, Rochester, NY 14624 X Website→ 1-800-253-3449 295 Robinson St, Suite 101 Oakville, ON L6J 1G7 X"
  },
  {
    "url": "https://bhcglobal.com/technical-architect",
    "headings": [
      "Technical Architect"
    ],
    "content": "Description As a member of the Delivery organization, a technical architect is to deliver implementation support and solutions to Oracle Utilities Application customers while serving as an advocate for customer needs. This involves designing and architecting customer solutions, leading portions of the delivery team, and resolving non-technical and technical customer issues.&nbsp; Work is performed at the customer site as well as remote. Requirements Strong communication skills Experience with Customer Information Systems Oracle CC&B v2.1-2.7/C2M (predecessor applications SPL, CIS+, PeopleSoft a plus) Coordinate technical activities in support of Conversion, Development, Deployment and Functional activities Develop strategies and design specifications for business and system computing environment Provide technical support on customer modifications, interfaces, data conversion development, and infrastructure design, specification roll out Coordinate integration with third party solutions Bachelor’s Degree or equivalent in Information Technology, Computer Science, or a closely related field Careers Locations BHC Portal Website→ 1-800-253-3449 90 Airpark Dr Ste 200, Rochester, NY 14624 X Website→ 1-800-253-3449 295 Robinson St, Suite 101 Oakville, ON L6J 1G7 X"
  },
  {
    "url": "https://bhcglobal.com/test-and-training-lead",
    "headings": [
      "Test and Training Lead"
    ],
    "content": "Description Have the knowledge and skill to develop and facilitate training programs and create detailed training manuals. Can develop a test strategy plan, include and manage the appropriate testing tools, and provide support for projects. Requirements Complete project test plans that include processes for tracking test result and defect resolution Develop test script templates, which are designed to automatically roll up metrics for reporting purposes Complete written procedures for testers that shall be followed once testing begins Participate in the development of the defect tracking process, and complete written procedures that are to be followed Utilize BHC training documents and customize them to specific clients Deliver onsite functional training for all modules A deep understanding of all phases of a project life cycle implementation Bachelor’s Degree or equivalent in Information Technology, Computer Science, or a closely related field Careers Locations BHC Portal Website→ 1-800-253-3449 90 Airpark Dr Ste 200, Rochester, NY 14624 X Website→ 1-800-253-3449 295 Robinson St, Suite 101 Oakville, ON L6J 1G7 X"
  },
  {
    "url": "https://bhcglobal.com/project-manager",
    "headings": [
      "Project Manager"
    ],
    "content": "Description The Senior Oracle Project Manager is primarily responsible for the management of a full scale implementation project.  This position is responsible for driving the documentation and proactive communication of project goals, measures of success, plans, status, issues, and risks in a timely manner to team members, stakeholders and senior management. Requirements Minimum 10 years of Project Manager experience Minimum 5 years experience Managed minimum of 2 successful full scale implementations Good understanding of regulated and deregulated utility markets and sound knowledge on Oracle Utility products A deep understanding of all phases of a project life cycle implementation Define project tasks and resource requirements Manage project budget Track project deliverables using appropriate tools Constantly monitor and report on progress of the project to all stakeholders Bachelor’s Degree or equivalent in Information Technology, Computer Science, or a closely related field Careers Locations BHC Portal Website→ 1-800-253-3449 90 Airpark Dr Ste 200, Rochester, NY 14624 X Website→ 1-800-253-3449 295 Robinson St, Suite 101 Oakville, ON L6J 1G7 X"
  },
  {
    "url": "https://bhcglobal.com/conversion-architect",
    "headings": [
      "Conversion Architect"
    ],
    "content": "Description Senior Data Conversion role is within the Oracle Utilities professional services organization, focused on providing conversion leadership for Customer Care & Billing (CC&B), Meter Data Management (MDM) or similar product implementations. Experience should include multi-product implementations (CC&B integrations with MWM, MDM, WAM, CCS, etc). A successful candidate will be able to define design and implement the data conversion strategy for a Customer to Meter solution implementation project. The role involves performing end to end data conversion activities for a project. Requirements Define and document data conversion strategy Mentor/develop other resources Contribute to reusable collateral/accelerators Participate in business development, including customer presentations and RFP responses related to conversion lead role Knowledge sharing across peer group Provide leadership to the Data Conversion team by promoting consistency across the team, including methodology, deliverable templates, terminology, etc Provide leadership and guidance in defining the CC&B Conversion Strategy Lead legacy data mapping exercises Align with business functional team to ensure data conversion aligns with the functional solution being implemente Define and execute conversion reconciliation processes Lead mock data conversion exercise Participating in dress rehearsal and go-live activities Provide utilities industry and CC&B best practices Careers Locations BHC Portal Website→ 1-800-253-3449 90 Airpark Dr Ste 200, Rochester, NY 14624 X Website→ 1-800-253-3449 295 Robinson St, Suite 101 Oakville, ON L6J 1G7 X"
  },
  {
    "url": "https://bhcglobal.com/functional-architect",
    "headings": [
      "Functional Architect"
    ],
    "content": "Description As a member of the Delivery organization, a Functional Architect is to deliver implementation support and solutions to Oracle Utilities Application customers while serving as an advocate for customer needs. This involves designing and architecting customer solutions, leading functional requirements gathering work sessions, leading portions of the delivery team, and resolving non-technical and technical customer issues. The Functional Architect must have experience in leading several project life cycle implementations from start to finish. Work is performed at the customer site as well as remote. Requirements Strong communication skills Strong experience with Customer Information Systems Oracle CC&B v2.1-2.7/C2M (predecessor applications SPL CIS+, PeopleSoft are a plus) Strong functional knowledge of all subsystems Strong knowledge of schema (tables and relationships) A deep understanding of all phases of a project life cycle implementation Directly involved on conversion mapping for new configurations Prototype and Configure production systems Facilitate and conduct fit/gap and business process workshops for all CIS subsystems Ability to lead test plan development and strategy execution Ability to train Bachelor’s Degree or equivalent in Information Technology, Computer Science, or a closely related field Careers Locations BHC Portal Website→ 1-800-253-3449 90 Airpark Dr Ste 200, Rochester, NY 14624 X Website→ 1-800-253-3449 295 Robinson St, Suite 101 Oakville, ON L6J 1G7 X"
  }
]